app/Controllers/AutoresController.php

SELECT *
FROM `autores`
---
    public function index(): string
    {
        $autor = new AutoresModel();
        $datos['datos'] = $autor->findAll();

SELECT *
FROM `autores`
WHERE `codigo_autor` = '2'
 LIMIT 1
---
    public function buscar($id)
    {
        $autor = new AutoresModel();
        $datos['datos'] = $autor->where('codigo_autor', $id)->first();