app/Controllers/EditorialesController.php

SELECT *
FROM `editoriales`
---
    public function index(): string
    {
        $editorial = new EditorialesModel();
        $datos['datos'] = $editorial->findAll();