app/Controllers/LibrosController.php

    public function index(): string
    {
        $libro = new LibrosModel();

        $db = \Config\Database::connect();
        $builder = $db->table('libros');
        $builder->select("libros.*, editoriales.nombre as Editorial");
        $builder->join('editoriales', 'libros.codigo_editorial = editoriales.codigo_editorial');
        $builder->join('estados', 'libros.estado = estados.codigo_estado');
        $query = $builder->get();

        $datos['datos'] = $query;

        $estado = new EstadosModel();
        $datos['datosEstados'] = $estado->findAll();

        $editorial = new EditorialesModel();
        $datos['datosEditoriales'] = $editorial->findAll();
---
SELECT `libros`.*, `editoriales`.`nombre` as `Editorial`
FROM `libros`
JOIN `editoriales` ON `libros`.`codigo_editorial` = `editoriales`.`codigo_editorial`
JOIN `estados` ON `libros`.`estado` = `estados`.`codigo_estado`
SELECT *
FROM `estados`
SELECT *
FROM `editoriales`

    public function buscar($id)
    {
        $libro = new LibrosModel();
        $estado = new EstadosModel();
        $editorial = new EditorialesModel();

        $datos['datos'] = $libro->where('codigo_libro', $id)->first();
        $datos['datosEstados'] = $estado->findAll();
        $datos['datosEditoriales'] = $editorial->findAll();
---
SELECT *
FROM `libros`
WHERE `codigo_libro` = '100031'
 LIMIT 1
SELECT *
FROM `estados`
SELECT *
FROM `editoriales`